{
    "Format": "1.3",
    "Changes": [
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Shane",
            "Entries": {
                "Mon": "What do you want?",
                "danceRejection": "...No thanks.$s",
                "Mon2": "It's just one of those days, @...$s",
                "Mon6": "I love hot peppers on my pizza. Do you like spicy food, @?#$e# ... ... ... I may have forgotten how socializing works.",
                "Mon8": "I really like rainy weather but recently sunny days have really start to grow on me.#$e# How are you doing, @? Is farm work treating you well?",
                "spring_Mon10": "In case I haven't told you yet... Thanks for being there for me, @. It means a lot to me.$1#$e# I've slowly started to tone down my drinking habits. It's nice to have extra cash.#$e# Say, do you want to come over some time this week?$h#$e# We can hang out in my room if you want to. It'll be fun. $h#$e# Why are you looking at me like that? ...Huh? No! That's not what I meant at all!$b",
                "summer_Mon10": "It's been way too hot lately, which is a good thing. It stops my drinking urges.#$e# I'm happy you still come to talk to me even though I know you're very busy.",
                "fall_Mon10": "Don't you feel somber sometimes watching leaves fall from the trees? Maybe it's just me...#$e# Marnie and a few other people told me that I am a lot more approachable lately. It's thanks to you, @.$1",
                "winter_Mon10": "I think I need a new jacket...#$e# Are you cold, @? What do you say we eat some delicious, hot pizza? $1",
                "Tue": "Huh? Sorry, I'm busy.",
                "Tue2": "You again, huh... What is it you want from me anyway?",
                "Tue6": "Life isn't so bad... at least I have frozen pizza and eggs.#$u# and you, @.$1 Say, @. Will you make me a fresh, homemade pizza one day?",
                "Tue8": "Hey, @. Have you tried the pizza that Gus made? It's pretty good, you know.#$e# I don't really like eating chicken. They are such innocent creatures.",
                "spring_Tue10": "Glad to see you taking a break from farm work, @. Don't overdo it, okay? I don't want you to get sick.#$e# Huh, what's that? You want me to take care of you when you're sick? Why don't you focus on trying to not get sick instead?$1#$e#",
                "summer_Tue10": "It's hot pepper season. Are you growing some at the farm right now, @?#$e# I can use some pepper poppers right now. I'll share it with you, of course. It's one of the few things I can actually cook.",
                "fall_Tue10": "... ... Oh, it's you @.#$e# Sorry, I was kind of deep in thought. Just thinking about trying to find a job somewhere else. Say, are you looking for helpers at the farm?$1#$e# I was just joking. But I'd like to spend more time with you.$1",
                "winter_Tue10": "Want to watch some movies at my place tonight if you're not busy? It's quite warm inside my room.#$e# I saw your pet running around your farm a few days ago. It's really cute.",
                "Wed": "Sorry but I've got a lot on my mind right now.",
                "Wed2": "Oh, it's you.#$e# Telling you to leave me alone is not gonna work is it?#$e# ...Sorry, I just have a lot in my mind.",
                "Wed6": "Here to keep me company again, huh?#$e# Sorry, if I that came out rude. I'm just not used to having a company.#$e# @, are you just naturally nice to everyone?",
                "Wed8": "I've never had much of a family when I was a kid... Thanks for having my back, @. I know I haven't been the easiest person to deal with.#1#$e# You know, Marnie and Jas really likes you. Maybe they're thankful that you're here to fix me up. But I guess I am too...",
                "spring_Wed10": "I tried making my own pizza yesterday but it came out all mushy.#$e# Are you good at cooking, @? Maybe you can give me an advice or two. I'm trying to eat healthier.#$e# I know, I know. Pizza is pizza. But at least it'd be homemade this time. That's slightly healthier.",
                "summer_Wed10": "I had a dream about you last night.$1#$e# What? I'm not telling what it was. It's rather embarassing.",
                "fall_Wed10": "I'd pick the pizza Gus made over Jojo's anytime. But of course the one you make is the best.#$e# I should stop eating so much pizza. What do you say, @?",
                "winter_Wed10": "Today is a good day to sleep in. But again, so is everyday. Do you ever have one of those days, @?#$e# I wish I could just work from under my blanket.",
                "Thu": "...Aren't you supposed to be ignoring me like everyone else in this town?$s.",
                "Thu4": "You're really persistent. I guess I'm just surprised that anyone would be interested in talking to me...",
                "Thu6": "Buh... It's one of those days, @. I'd kill for a coffee right about now...",
                "Thu8": "Oh, uh. Hi, @.$1#$e# You look nice today... Not that you don't look nice everyday.$3#$e# Sorry, I've been getting flustered when I see you lately...$4",
                "spring_Thu10": "I still get a little uncomfortable around people but I think I'm getting a lot better. It's all thanks to you, @.#$e# I think Gus is making less money ever since I stopped drinking so much.$1",
                "summer_Thu10": "Aside from festivals, I don't really go to the beach. I'd rather stay indoor and watch some TV. Care to join me? #$e# I wish there's a store that sells DVDs around here.",
                "fall_Thu10": "We should try playing the pool in the saloon one day.#$e# Have you ever completed Journey of the Praire King? I have a copy at my place, maybe you can help me beat it.$h",
                "winter_Thu10": "Winter is one big excuse for me to stay indoor and eat pizza.#$e# I heard there's a secret forest somewhere in Cindersap forest. Have you ever been there, @?",
                "Fri": "@? What are you doing here? I'm sure there are much cuter guys you could be talking to right now...",
                "JojaMart": "%Shane's hard at work. Let's let him focus.",
                "Fri4": "$d Joja#What's the point of life if all you do is work? @, please tell me the answer...|I haven't been able to pay my rent, but Marnie's letting me stay anyway. I'm lucky.",
                "Fri6": "Mind keeping me company at the saloon tonight, @? #$e# Perhaps you can help me to stop drinking so much... Is that too much to ask?",
                "Fri8": "How do you do it @, Having the determination to work everyday? It's quite an impressive feat. Farming is not an easy job.",
                "spring_Fri10": "I hate my job at JojaMart but at least now I have something to look forward to when I finish. You know what I mean?$b#$e# Well, a job's a job. Better than being unemployed I suppose.#$e# I'd like to help you out on the farm one day.",
                "summer_Fri10": "The saloon gets way too crowded on Fridays, it makes me kind of uncomfortable. Will you accompany me, @?",
                "fall_Fri10": "Is it okay if I hold you for a bit, @?$4#$e# Sorry, I'm not good at being romantic or whatever.",
                "Sat": "...Please let me be alone.",
                "Sat8": "I think I'm seriously starting to like... This place. Uh what about you, @, will you be sticking around?$1",
                "spring_Sat10": "I'm really craving some beer right now. But I probably shouldn't have any or I'll pick up my drinking habit again.#$e# If you see me trying to drink one feel free to slap my hand.",
                "summer_Sat10": "Do you ever buy seeds from Jojo's? Let me tell you something: Don't.#$e# Hey @, is it okay if I come over sometimes?$1",
                "fall_Sat10": "Hello, @. Do you want some coffee?#$e# It's one of those days where I want to go out and have some fresh air.",
                "winter_Sat10": "I can use some hot chocolate right now. What about you, @?#$e# I'll tell you what, I'm pretty good at making snowmen.",
                "Sun": "Sorry but I'm busy. Frozen pizza is calling my name...",
                "Sun6": "...I think I might be gaining weight. Not that it makes much difference. I'm still just as unattractive as ever...$s",
                "Sun8": "You know, now and again I don't mind a bit of TV. Maybe we should catch a flick together sometime, @... If you're not too busy...$u",
                "spring_Sun10": "Hi, @. Guess I've actually been having a pretty good day so far. After all, you showed up!$1#$e# Fancy some homemade pizza? Actually, scratch that. I don't want you getting food poisoning.#$e# Have a lot planned today? Maybe we can hang out for a bit.",
                "summer_Sun10": "Do you like swimming, @?#$e# I don't really like swimming but if you ever want to, I guess I'll be okay with it.",
                "fall_Sun10": "I want to go back home and sleep, but I also want to spend some time with you, @.$1#$e# I'm an extremely lucky guy to have someone like you with me.",
                "winter_Sun10": "I think I'm losing some weight. Must be because I stopped drinking and eating so much pizza.#$e# I gotta admit though, I do miss pizza.",
                "Sun2": "You again? What do you want with a loser like me anyway?$s",
                "event_stadium1": "Oh yeah? I guess that makes sense.$6#$b#Me? I get bored with Pelican Town sometimes.#$b#But... I like that you're different, @. We balance each other out.$l",
                "event_stadium2": "Oh really? I'm surprised... Didn't you move to Stardew Valley to escape the noise of the city?$6#$b$#I mean... Don't get me wrong, I totally understand. My life isn't exactly the greatest in Pelican town after all..."
            }
        }
    ]
}