{
"spouseRoom_Jodi": "Good morning Honey.#$e#*Yawn* I feel so sleepy...",
"Rainy_Day_0": "It's raining outside. Make sure you don't catch cold, dear.#$e#Stay indoors as much as possible.#$e#I worry about you sometimes!",
"Rainy_Day_1": "It's raining! That means we don't have to water the crops today.#$e#Nature can be a big help sometimes.#$e#Have you fed the animals yet, honey?",
"Rainy_Day_2": "Good morning! I woke up early from the sound of the rain and made you some breakfast. [194 195 210 211 216]  #$e#Stay warm and don't work too hard. I want you to stay healthy.",
"Rainy_Day_3": "What's on your agenda today, dear?#$e#I don't want to go outside in this weather... I'll just do some things around the house.#$e#Maybe I'll make something hot for dinner.",
"Rainy_Day_4": "Any dinner requests for tonight?",
"Rainy_Night_0": "The rain makes it feel like we're all alone.$6#$e#I'm cold... Aren't you ready to tuck into bed?$6",
"Rainy_Night_1": "Make sure you change into something warm. I don't want you to get sick.#$e#Can you hear the rain pattering on the roof, @?",
"Rainy_Night_2": "Ah...The soothing sound of rain overhead... I'm going to sleep well tonight.",
"Rainy_Night_3": "The rain makes our home seem so cozy.^It's nights like this I'm glad we have a quality roof.",
"Rainy_Night_4": "I made some soup for dinner. [199 218 219 727 730]#$e#You need something hot on a day like this!",
"Rainy_Night_5": "I'm glad you're home... It's a good night to stay inside.",
"Indoor_Day_0": "Good morning ~<#$e#Ready for a hard day's work? I am.",
"Indoor_Day_1": "Hi, honey! Smells good, doesn't it? I made you breakfast! [194 195 210 211 216]#$e#You need food to stay energized throughout the day.",
"Indoor_Day_2": "Did you sleep well?#$e#I've got some chores to do in here.",
"Indoor_Day_3": "Did you have any strange dreams last night?#$e#I did, but all I remember is that it had something to do with a %adj %noun. Weird.$s#$e#Hehe. Dreams don't mean anything... do they, Honey?#$e#Well, we can't spend all day chit-chatting. You have work to do!",
"Indoor_Day_4": "Good morning, dear. Another day of farm chores, huh?#$e#I'll be cheering for you. <",
"Indoor_Night_0": "Did you get everything done today, @?#$e#I did some house chores... but now I'm so tired.#$e#I'm ready for bed whenever you are.",
"Indoor_Night_1": "Wow, you look like you did a lot of work today.#$e#Now you should just relax and kick back for the night.",
"Indoor_Night_2": "I'm glad you're home.#$e#I'm not used to being alone at night.$2",
"Indoor_Night_3": "Are you done with your work for the day? I'm ready to have some fun.$7#$e#But if you're tired I understand.$6",
"Indoor_Night_4": "*phew*! I just finished my chores. Now we can spend some time together.#$e#So, tell me about your day.",
"OneKid_0": "Have you spent any time with %kid1 today?",
"OneKid_1": "I wonder if %kid1 will grow up to be a farmer like you?.",
"OneKid_2": "Don't worry, I'll feed %kid1 today. You can just focus on running the farm.",
"OneKid_3": "Life change a lot when you have kids, right?.",
"TwoKids_0": "I already gave %kid1 and %kid2 their breakfast. They were hungry!",
"TwoKids_1": "We have to make sure and give %kid1 a lot of attention now that we have %kid2. We don't want any jealousy between them.",
"TwoKids_2": "You know, I think %kid2 has your nose.",
"TwoKids_3": "Living at the farm is so nice @. I'm glad we can raise %kid1 and %kid2 here",
"Good_0": "It's hard to believe we're finally married...",
"Good_1": "You know, it's surprising that we ended together. I'm so happy about it though.",
"Good_2": "Are you enjoying our married life, @?#$e#I am.",
"Good_3": "Wow, you look really handsome today!^Wow, you look beautiful today.",
"Good_4": "This place is my home now... I'm happy here.",
"Good_5": "I was just admiring my wedding amulet... The shell is flawless. It must have cost you a fortune!",
"Good_6": "Be careful out there! Sometimes I worry about you falling into a mine shaft.",
"Good_7": "@? I just want to say that I appreciate all the hard work you do for our household.",
"Good_8": "Don't worry about me... I know you've got a lot of responsibilities outside of the house. I'm fine in here by myself!",
"Good_9": "Oh, I'm not bored... I'm just enjoying what we have here.#$e#It's a simple life, but I like it.$h",
"spring_1": "Well, a new year has arrived. Do you have a plan for what you want to accomplish this year?#$e#I feel pretty hopeful.",
"spring_8": "Now that winter's over, we've got lots of productive weather to look forward to.",
"spring_23": "Tomorrow is the flower dance... Are you going to dance dieguito?.",
"summer_1": "Make sure you don't get a heat stroke, dear.#$e#Drink plenty of water and don't overwork yourself.",
"summer_8": "Sorry if I smell... I was sweating all night in the heat.",
"summer_15": "It's summer... that means the house is full of flies.#$e#Don't worry, I'll take care of them.",
"fall_1": "This weather feels pretty nice after the heat of summer.",
"fall_8": "Winter's just around the corner. We need to double check the heating system, turn off the valves, and check all the insulation in the house.#$e#Don't worry, I'll take care of it all.",
"fall_15": "Have you figured out what you're going to use for our grange display tomorrow?",
"fall_26": "Should we go to the Spirit's Eve festival tomorrow night?",
"winter_1": "Brrr.... It's cold. I guess winter has arrived.",
"winter_7": "Are you going to enter the fishing contest tomorrow?",
"winter_28": "Thanks for a great year, @. I'm excited to tackle next year together.",
"Rainy_Day_6": "I love to curl up with you on days like this...$6",
"summer_Mon10": "Grapes are one of the few fruits I can get Vincent to eat. He just gobbles them up.$h#$e#Will we be growing any on the farm later this year?",
"summer_Tue10": "Do you ever have trouble sleeping, @? I sleep so well with you...$6",
"summer_Wed10": "If I was rich the first thing I'd do would be to hire a maid and a chef.#$e#My goodness, that would be nice!$h",
"spring_Sun10": "I'm thankful for the education that Vince gets from Penny. He wouldn't get as much one-on-one attention at a public school.#$e#Plus, commuting out of town to a public school is off the table, anyway.", 
"summer_Thu10": "You are truly a good person, @. Thank you for all you've done for me.",
"summer_Fri10": "Want to do anything together this weekend honey?.#$b#Maybe we can go to the spa.$6",
"summer_Sat10": "Have you heard Sam play his guitar recently? He's actually really good!$h#$b#...I hope he doesn't bother his neighbors too much.$2",
"summer_Sun10": "The other day I taked a nap. I'd never have time for it before, it was nice.",
"fall_Mon10": "I want Sam to make some achievable goals for his future, but every time I talk with him about it, he just says he has everything under control.$s#$b#It's difficult being a parent when I know it's no longer my job to solve his problems for him.$2",
"fall_Tue10": "I've always believed that childhood is something that should be cherished and protected, but...#$e#Maybe I made some mistakes. I just wanted the best for Sam and Vince. Did I try too hard?$2",
"fall_Wed10": "I can't stand to think about the war too much. But sometimes, I can't help but worry what kind of world Sam and Vincent will inherit.$s#$e#What else is there to do but carry on?",		
"fall_Thu10": "The valley looks so beautiful this time of the year. I never noticed before...",
"fall_Fri10": "I'm glad you moved into town, honey. There are few people I've met who are as generous and caring as you.",
"fall_Sat10": "It's getting kind of cold lately.#$b#Maybe later we can cuddle together by the chimney.",
"fall_Sun10": "I wonder what Caroline is doing.",
"winter_Mon10": "Hey Honey. I feel so energetic today!.",
"winter_Tue10": "You must get your daily exercise pretty easily with your farmwork, huh?$h#$e#I only work out once per week. Maybe I should try to do it more often",
"winter_Wed10": "Do we have enough wood stockpiled to pass the winter @?. I can talk with Robin if we need some more.",
"winter_Thu10": "Now that I have time, maybe I should try finding a hobby.#$e#What do you think?.",
"winter_Fri10": "Not too long before the year ends, huh? I can't believe it's already almost over.",
"winter_Sat10": "I love the winter view, but the walk to my old house get difficult with all the snow.#$e#Mmm, Do you think we can afford a sled and six huskies?.1",
"winter_Sun10": "It's so cold today... I hope it gets warmer soon.",
"spring_Mon10": "I want Sam to make some achievable goals for his future, but every time I talk with him about it, he just says he has everything under control.$s#$b#It's difficult being a parent when I know it's no longer my job to solve his problems for him.$s",
"spring_Tue10": "Exercise is important for staying healthy. I always make sure to set aside some time for it.",
"spring_Wed10": "Hmm... I wonder if I should pick up some allergy medicine for Sam today...",
"spring_Thu10": "I had enough time to take a nap the other day. I'd almost forgotten what it's like.$h",
"spring_Fri10": "The springtime air is wonderful.$h#$b#Just... please don't bring any spring flowers near Sam's, he's terribly allergic.#$e#He had a deathly serious reaction once, when he was little. I can't remember ever being more scared.$s",
"spring_Sat10": "If I was rich the first thing I'd do would be to hire a maid and a chef.#$e#My goodness, that would be nice!$h",
"spring_Sun10": "You are truly a good person, @. Thank you for all you've done for me.",
}