{
"Format": "1.0.0",
"Changes": [
{
"Action": "EditData",
"Target": "Characters/Dialogue/MarriageDialogueElliott",
"Entries": {
	"Rainy_Day_0": "I feel inspired today... I think I'll do some writing.#$e#Our conversation last night sparked several ideas, and my story calls to me.$6" ,
    "Rainy_Day_1": "The sound of rain, in some tiny way, reminds me of my cabin by the beach.#$e#The farm is wonderful, but I do miss the sound of the ocean.#$e#Next sunny day, how about taking a trip with me to the tidepools?$6" ,
    "Rainy_Day_2": "I got up early and made coffee.[395]#$e#I find that a cup of this exquisite brew makes the early morning a lot more pleasant.$6#$e#Made even more so by the sight of your lovely face sipping it.$l" ,
    "Rainy_Day_3": "I think I'll remain indoors today, my dear. I don't wish to get my hair wet.#$e#I do love a storm... but best viewed from within my warm and toasty abode, where I can appreciate it without getting drenched.$6#$e#My darling, have you been out in that weather? Come here, and let me get you nicely warmed in my arms.$l" ,
    "Rainy_Day_4": "My inspiration for writing is like the weather... it comes and goes at random. Today I feel entirely dull.$s#$e#Perhaps I'll read one of the classics to get my creative juices flowing.$7#$e#Reading was of no help for my inspiration, but it has been a pleasant way to spend a rainy day.$6#$e#Would you like to join me, my love?$l" ,
    "Rainy_Day_5": "Listen to that rain! A torrential downpour, shuttering the world from sight with a great wall of water.#$e#This is the perfect excuse for you to spend the day inside, within the strong circle of my arms.$l#$e#I admit to no ulterior motives, but I do believe we would be much more toasty, were we in bed, under the blanket. Come, my love.$l" ,
    "Rainy_Day_6": "The sound of the rain on the roof makes me feel so at peace, as does the vision of your gorgeous face on this stormy morn.$l#$e#The storm has put such a chill into the air. I stoked the fire, and made this to warm you up, darling. I hope you like it, it's one of my favorites.[218]$h#$e#The world is born anew with every stormy day, I can't wait to see what tomorrow brings.$6" ,
    "Rainy_Day_Elliott": "The rain makes me think of my old life by the ocean.#$e#Change is part of life. That's okay." ,
    "patio_Elliott": "Ah, what a lovely day to read a book... don't you think, my dear?#$e#It's so peaceful here, I can feel myself being revitilized by the sun's lifegiving rays.#$e#Ah, there is the smile I love. As invigorating as the sun itself.$l#$e#I'll read for a bit longer, though your lovely face is a welcome sight.$h#$b#A kiss for your husband, before you run off again?$l" ,
    "Rainy_Night_0": "Good evening. Did you have a productive day, my love?#$e#I had a fine day, myself. I have ten new pages, though you must wait until the end of the chapter before you read them!$8#$b#I'd love your opinion then, your thoughts always help me out immensely.$h#$e#You didn't get too drenched out in the storm, did you? Let your husband warm you up, and take care of you now.$l" ,
    "Rainy_Night_1": "You're ice cold! Let me keep you warm.$l#$e#I could write a hundred poems about each of your adorable expressions, and never have enough words to match how you make my heart race.$l#$b#Let me have your hand.$6#$b#See, feel that?$h#$b#You can feel my heart, beating for your alone.$1#$e#I plan on kissing you from the curve of your ear, to the nape of your neck, and then brushing my lips across yours...#$b#...until I've so properly heated you up from the cold of the day, that you take mine in return.$l" ,
    "Rainy_Night_2": "My skill with words is unmatched, yet I can't find the way to properly describe your allure.$l^My skill with words is unmatched, yet I can't find the way to properly describe your beauty.$l#$e#Your eyes set my soul aflame.$l#$e#If you don't come to bed soon, I'll be forced to pick you up and carry you there. These arms aren't just for show.$h" ,
    "Rainy_Night_3": "What did I do today? I'll just say this... it takes a lot of work to maintain this rugged physique!$h#$e#Did you know, when I first moved to town, not too long before you did, my love, Alex was convinced I had a secret stash of muscle-inducing drugs.$8#$b#He seemed somewhat crestfallen to learn it was all hard work, and a lot of it.$6#$b#But he seemed to apply himself with even more determination after that.$h" ,
    "Rainy_Night_4": "I spent the afternoon daydreaming about the ocean. So I decided to cook some seafood. [198 202 727 728]$h#$e#I miss the salt-faring fish, though I've learned some new delicious recipes for our fresh-water friends.#$b#If you could, darling... remember to let the small ones go, so that we keep the fish populous happy and hearty$6#$b#We don't want to tax the areas reserves.$s" ,
    "Rainy_Night_5": "You worked hard today, darling. Come, let me massage those shoulders.$l#$e#I can feel the tension of the day melt away under my hands. I do love putting these dexterious fingers to good use.$6#$e#They never lived up to my expectations at the piano, but I believe they become more skilled in the Art of @ with every passing day.$h#$b#It's an accomplishment I'm quite proud of.$l" ,
    "Rainy_Night_6": "There is nothing better in this world then spending a night in our cozy house, with the rain pounding outside...$6#$b#...and my love here, tight in my embrace.$l" ,
    "Rainy_Night_Elliott": "Sit down, relax! You've got to be tired after trudging through the mud all day." ,
    "Indoor_Day_0": "I've been taking much better care of myself now that we're together. The bachelor life wasn't particularly healthy for me.$u#$e#I never realized just how lonely I was, trying to live that life.$s#$b#Now every day I open my eyes, I feel a surge of happiness at feeling your warmth in my..our.. bed.$l#$e#Even when we have our little arguments, there's still a deep happiness that fills a place I never knew was so empty.$l" ,
    "Indoor_Day_1": "Good morning, @! I made us a pot of coffee.[395]#$e#I find myself craving this robust flavor nearly every morning.#$e#Ah, these are the perfect mornings. The scent of fragrant fresh coffee, the sweet sound of birds singing, and the sight of my love's captivating face.$h" ,
    "Indoor_Day_2": "If you find a spider in the house, don't squash it! Just let me know and I'll take the poor thing outside.#$e#I do admit a fondness for them, as they keep the flies in check. I'm sure %pet agrees with me!" ,
    "Indoor_Day_3": "Today is going to be a fantastic day... I can feel it!$h#$e#I get this special feeling in my nose...#$b#What's it like? It's like... a tickle, telling me something wonderous is going to happen this day.$h#$e#You do give the universe a run for its money, though... One of your kisses, and I'm floating in the clouds.$6" ,
    "Indoor_Day_4": "I've had this recurring nightmare that you gave me a buzz cut... You wouldn't ever do that to me, would you?$s#$e#I trust you.#$e#And you love my hair, don't you? I can tell by the way you're always threading your fingers through it. You would never cut it off... Right?$1" ,
    "Indoor_Day_5": "Strange the twists and turns life takes you.#$b#When I came to this little town, with my romantic notion of shuttering myself away on the beach for my art, little did I guess the true reason fate brought me here.$6#$e#It wasn't the seclusion that breathed new life into my writing, it was meeting you.$h#$b#Your belief in me, your kind words -- you were my inspiration, my muse and my love.$l#$e#You stole my heart before I even realized it was gone.$l" ,
    "Indoor_Day_6": "What are your plans today, @? I'm determined to get at least 1000 words written by the time of your return. Wish me luck, love.$6#$e#Ah, my legs are so stiff today. I had to get up and move around a bit. I'm trying to remember to take a turn around the room at least once an hour.#$e#You look rather fetching today, @. Do you have time for a kiss and a cuddle?$l" ,
    "Indoor_Day_Elliott": "I've been keeping a journal ever since we moved in together. Now that I actually have a life, I have lots to write about.$h#$e#I want to make sure I always remember these years." ,
    "Indoor_Night_0": "From the brightest winter star, to the shimmer of an iridium vein... nothing can compare to my wonderful man.$l^From the brightest winter star, to the fragrant fairy rose... nothing can compare with your captivating beauty.$l" ,
    "Indoor_Night_1": "A crackling fire adds wonderful ambience to the house... every piece of wood burns in a unique way.#$e#When I was a boy, I would toast marshmallows over the fire, and be so caught up in watching the dance of the flame...#$b#...that my marshmallow would either be burnt to a crisp or fall off the stick entirely.$h#$e#But I did love that sweet goodness, whenever I happened to pluck one from the jaws of fiery death. We should try it sometime.$h" ,
    "Indoor_Night_2": "I never had much success growing plant in my old beach house. Hopefully I can pick up a thing or two by watching you.#$e#In this respect, you are the master and I only a humble apprentice." ,
    "Indoor_Night_3": "When I behold thy wondrous face, a precious jewel of form and grace, my heart... torn by the dread of night, is purified with golden light.$6#$e#Poetry is the only way I can begin to describe my feelings for you.$l" ,
    "Indoor_Night_4": "My love... I wouldn't trade you for 100 iridium bars.#$e#Nor 1000...#$e#Not even 10,000 bars, no.$7#$e#...$7#$e#No, not even 100,000 bars!$a#$e#...$s#$e#Wa... one million bars of pure iridium...? Don't make me do this...$8" ,
    "Indoor_Night_5": "Hearing your footfalls on the steps always brings a jolt of elecricty to me. Never do I tire of seeing that face walk through the door.$l#$e#I hope your day was good, my love? Please, sit here with me and tell me all about your daily adventures.$h#$e#Tomorrow remind me to move those casks, my love. I enjoy putting these arms to good use for you, but sometimes get caught up in a fit of inspiration...#$b#Just remind me, and I shall move anything you desire.$l" ,
    "Indoor_Night_6": "What a day. I re-wrote the same page ten times. The dialogue was fine, but those descriptors!#$e#Show, don't tell, they say. Well, sometimes that's hard to do when the scene just doesn't want to cooperate.#$e#Ahhh, my love. Thank you for the shoulder massage. I didn't know I held such tension, until your gifted hands released it from me.#$b#Come, let me return the favor.$l" ,
    "Indoor_Night_Elliott": "#$c .5#You always smell so good after a day of hard work. It's your natural musk!^You smell sweet, my dear. Like a honeycomb drifting on a pool of spice tea.#$e#Come here, let me massage your back. You look tense.$l^You smell sweet, my dear. Like a cinnamon leaf floating in the summer breeze." ,
    "Outdoor_0": "My wildest dreams have come true... just look at this incredible landscape!$h#$e#The fresh air, the wind in my hair, the wild beauty surrounding us... I feel my soul and mind expanding to take in such joyous life.$6#$e#How happy my heart is, to share this with you.$l" ,
    "Outdoor_1": "Fertile soil beneath my feet, fresh air to fill my lungs, and the sun's warmth to delight my skin... Life is joyous.#$e#Seeing you there, with the sun shining down... you're like a vision of my heart.$l" ,
    "Outdoor_2": "I might stay here and write some poetry. I'm feeling a sudden surge of creativity! You go on ahead and take care of business.#$e#The sun sparks my imagination, I feel as if I'm one of those energy batteries you have placed about the farm.#$b#All I need now is to release this power back into my writing." ,
    "Outdoor_3": "If I stay perfectly still, perhaps a resplendent butterfly will bless my nose with a landing.$6#$e#Did you see the honey bees, going busily about their business? I believe we should have a new batch of honey soon." ,
    "Outdoor_4": "I drank too much coffee... my mouth feels about as dry as the Calico Desert.$s#$e#Oh... sorry about the coffee breath.$7#$e#Oh, you must love me. Coming back for another kiss, me still with this coffee breath. As it happens, I love you too.$l" ,
    "Outdoor_5": "This feels like a foraging day. I think I'll tromp around, and see what wonderful abundance nature has left to us.$6#$e#I believe I'll take the fishing pole with me, today. Nothing like a fresh catch for dinner.#$e#How are you doing, today, my love? I shall steal a kiss while you're here.$l" ,
    "Outdoor_6": "I can't stay inside and write today. I had to step away from the story, get a little distance.#$e#The sun will do me some good. And the sight of you is like a balm for my soul.#$b#I never believed those lines in romance books, about finding a home in someone. But here I am, proving each one of them to be truth.$h#$b#I found my home in you.$l" ,
    "Outdoor_Elliott": "Today, I'm going to continue writing my new novel. What better place than our wonderful farm?$h#$e#This is perfect.$l" ,
    "OneKid_0": "Have you had any time to entertain little %kid1 today? Maybe a second child will make things easier for both of us." ,
    "OneKid_1": "Little %kid1 is going to have the perfect childhood here. There's so much to explore.#$e#I took %kid1 out to explore the farm today.#$b#We had a marvelous time... ah, to see the world around me with the fresh eyes of a child again!$h#$e#Sometime soon we should take %kid1 to see the ocean, I would love to pass on my reverence for the sea.$6" ,
    "OneKid_2": "After a gave the little one a bath, we both fell asleep in the chair with %kid1 snuggled to my chest.$6#$e#The only thing that could've made the moment more perfect, would've been to have you there with us, my love.$l" ,
    "OneKid_3": "Caring for babies isn't exactly my strong suit... but I'll do my best to be a good father.#$e#I'm afraid I made a mess of us both today, trying to feed %kid1. Do I still have porridge in my hair?$s" ,
    "OneKid_4": "I believe little %kid1 is trying to emulate us.#$e#They were pounding away on the toy piano... but afterward, they lined up all their stuffed animals to feed and milk!$h" ,
    "TwoKids_0": "I already gave %kid1 and %kid2 their food. They eat a lot for such small creatures!#$e#I feel I have finally come into my own as a father... we didn't have one mishap during feeding today.$h#$e#I can't promise what will happen tomorrow, though." ,
    "TwoKids_1": "I was carrying %kid1 earlier, and I could've sworn I heard a \"Da...da\".$h#$e#I thought I'd felt the majesty of the world in the whispering of wind across the meadow, in the crash of wave against the shore...#$b#Nothing could've prepared me for the true majesty of the world, when I look into our children's eyes$6" ,
    "TwoKids_2": "I'm going to teach %kid1 to read as soon as possible! That's a great way for children to learn about the world." ,
    "TwoKids_3": "We've done well, @. The farm is doing excellent and our healthy children are a great joy. I couldn't be happier." ,
    "Good_0": "@... I'm so proud of all your hard work. I'm very lucky to have you.$l" ,
    "Good_1": "I made a whole secret book of poems expressing my love for you.$l#$e#You may try to find the book if you wish, darling... but I shall not reveal it to you. That is why it is secret.$h#$e#I can not resist those eyes, or especially not when you say such things.#$b#I shall make you a deal... every rainy Sunday, I will read you one poem. Thus, as I am always writing more, they will last our entire lifetime.$6" ,
    "Good_2": "I came to the valley to find the ivory tower from which my talents could reign supreme. But what I really found was a dungeon of loneliness. You saved me from that.$l#$e#Come, rest a moment in my arms, my dearest. Have I ever told you how happy you make me? Had I not met you, I may have perished a lonely hermit, with only words for company.#$b#Instead I am blessed to see your shining face when I awake each morning, and have you to share my innermost thoughts with each night." ,
    "Good_3": "Wow, you look really handsome today! Did you shave? Your jawline is perfect.$l^Your feminine allure is irresistible today. I can't keep my eyes off you.$l#$e#If you stay here much longer, I can't promise I won't keep you captured in my arms. You are far too enticing this day." ,
    "Good_4": "I feel burnt out in your absence. But when I hear that sound of muddy boots on wood, my heart rises from the ash." ,
    "Good_5": "I'm doing a walking meditation. It's good for creativity." ,
    "Good_6": "Be careful out there! I do worry about you sometimes. There are people in the world who would take advantage of you." ,
    "Good_7": "Light of my life, fire of my soul... am I getting too corny? Ah, I have to stop, but one look at you makes me want to spout the most romantic of poetry.$h#$e#Maybe you should come closer, and stop me with those mesmerizing lips of yours.$l" ,
    "Good_8": "Each day here breathes new life into my soul. I feel as if I could live forever, with you by my side.$6#$e#Sometimes simple words are best...#$b#I love you, @." ,
    "funLeave_Elliott": "I think I'll walk down to the beach today. It's always nice to see the ocean again." ,
    "funReturn_Elliott": "I had a nice time at the beach by myself. I watched the waves come and go, just like old times.$h" ,
    "Neutral_0": "Today will be a writing day for me. I hope your day is productive as I feel mine will be." ,
    "Neutral_1": "I plan on taking a walk into town later. I need the exercise, and feel a desire to spend a little time at my beach cabin." ,
    "Neutral_2": "I can't get my hair to behave today. Do you ever have one of those days? I feel a need for one of Alex's caps to cover this unsightly mane.$8" ,
    "Bad_5": "I haven't been to the libary in too long. Today seems like a good day to visit. I feel a need to get away the farm for a bit.$s" ,
    "Bad_6": "I wish you wouldn't look to me for all the house cleaning. I didn't mind at first, since I felt we had a partnership. It doesn't feel like that any longer, however.$s" ,
    "Bad_7": "While I may not be bringing in as much income as you, my writing is still important. I can't help but feel you no longer take my career seriously.$a" ,
    "spring_Elliott": "I'm looking forward to a beautiful year on %farm farm.$h" ,
    "spring_1": "My new year's resolution is to write, write, and write! I can never stop improving my skills.#$e#Do you have a plan for what you want to accomplish this year?#$e#I feel pretty hopeful with you by my side.$6" ,
    "spring_6": "Ahh, I admit, you caught me reading poetry.$l#$e#Would you like to stay a moment, and I will read a few lines for you?$6#$e#A fairy rose, ringed round with blue,#$b#A pale night's song, a cry, a moan,#$b#The wild staccato of mine heart's own rhythm, as in thine love, it is forged a-new.$1#$e#Shall I read more for you tonight, my love?$h" ,
    "spring_12": "It's strange, but I often have cravings for pomegranate in the spring.$6" ,
    "spring_16": "I love your morning bedhead...#$b#...the way your smile twists to one side when you find something truly amusing...#$b#...the little way you rub your feet together in bed like a cricket...#$b#...the soft sound of your sigh and the blush that suffuses your cheeks when I tell you these things.$h#$e#You, my darling one, are the keeper of my heart forever and always.$l" ,
    "spring_23": "I look forward to dancing with you tomorrow, my dear.$l" ,
    "summer_Elliott": "One of the main things I miss about the ocean is the fresh fish." ,
    "summer_1": "It's hard to be in a foul mood when the sun is beaming and the butterflies are dancing on a spice-berry breeze.$h#$e#Make sure you don't get a heat stroke, dear.#$e#Drink plenty of water and don't overwork yourself.#$b#Make sure to call me if you need help with anything, and I'll be right by your side!$6" ,
    "summer_6": "Ahh, I admit, you caught me reading poetry.$l#$e#Would you like to stay a moment, and I will read a few lines for you?$6#$e#A fairy rose, ringed round with blue,#$b#A pale night's song, a cry, a moan,#$b#The wild staccato of mine heart's own rhythm, as in thine love, it is forged a-new.$1#$e#Shall I read more for you tonight, my love?$h" ,
    "summer_10": "I was going to grab an extra bottle of ink from my cabin today, but then I remembered the Luau is tomorrow. I'll just do it then." ,
    "summer_16": "I love your morning bedhead...#$b#...the way your smile twists to one side when you find something truly amusing...#$b#...the little way you rub your feet together in bed like a cricket...#$b#...the soft sound of your sigh and the blush that suffuses your cheeks when I tell you these things.$h#$e#You, my darling one, are the keeper of my heart forever and always.$l" ,
    "summer_27": "All good things must come to an end, including the joyful days of summer. The key to happiness is to accept change without judgement." ,
    "fall_Elliott": "Ah... Fall. The warm sun drifts low in the sky, casting long shadows over waving fields of gold.#$e#It's a beautiful time of year, don't you think?" ,
    "fall_1": "The splendor of fall... a verdant banquet for all the senses to enjoy... has inspired some of the greatest poetry of all time.$h" ,
    "fall_6": "Ahh, I admit, you caught me reading poetry.$l#$e#Would you like to stay a moment, and I will read a few lines for you?$6#$e#A fairy rose, ringed round with blue,#$b#A pale night's song, a cry, a moan,#$b#The wild staccato of mine heart's own rhythm, as in thine love, it is forged a-new.$1#$e#Shall I read more for you tonight, my love?$h" ,
    "fall_15": "I might set my pride aside and sink my eager teeth into a sloppy, saucy barbecue sandwich tomorrow.$l#$e#Have you figured out what you're going to use for our grange display tomorrow?" ,
    "fall_20": "I love your morning bedhead...#$b#...the way your smile twists to one side when you find something truly amusing...#$b#...the little way you rub your feet together in bed like a cricket...#$b#...the soft sound of your sigh and the blush that suffuses your cheeks when I tell you these things.$h#$e#You, my darling one, are the keeper of my heart forever and always.$l" ,
    "fall_26": "Would you still love me if I guzzled two gallons of pumpkin ale at the Spirit's Eve festival? Sometimes a man has primitive urges..." ,
    "winter_Elliott": "I think I might do some writing this winter. There's not much else to do, anyway." ,
    "winter_1": "Winter is a great time to read books and play the piano. Remember to pause and enjoy a quiet moment or two." ,
    "winter_5": "Ahh, I admit, you caught me reading poetry.$l#$e#Would you like to stay a moment, and I will read a few lines for you?$6#$e#A fairy rose, ringed round with blue,#$b#A pale night's song, a cry, a moan,#$b#The wild staccato of mine heart's own rhythm, as in thine love, it is forged a-new.$1#$e#Shall I read more for you tonight, my love?$h" ,
    "winter_7": "I'm a little out of practice, but I plan on entering the fishing contest tomorrow! You've got some stiff competition, dear." ,
    "winter_16": "I love your morning bedhead...#$b#...the way your smile twists to one side when you find something truly amusing...#$b#...the little way you rub your feet together in bed like a cricket...#$b#...the soft sound of your sigh and the blush that suffuses your cheeks when I tell you these things.$h#$e#You, my darling one, are the keeper of my heart forever and always.$l" ,
    "winter_28": "Happy new year's eve, my dear. Please accept this to celebrate. [348]#$e#Each New Year's Eve, I feel a special blessing thinking back on our life together, and how that road continues into the wonderous future.$h#$e#There is no one in this wide world as amazing as you, my love, and no one I'd rather share my life with.$6#$b#I love you.$l",
    "spouseRoom_Elliott": "#$c .5#Inspiration calls with her sweet siren song, and I must follow where she leads.$h#$e#Will you be okay without my help?#$e#I promise I shall make it up to you, love.$1" 
	}
	}
]
}