	{	
		"spouseRoom_Robin": "Hey honey, good morning.#$e#Let me know if there's anything that need to be fixed.",
		"Rainy_Day_0": "It's raining. Not the most pleasant weather for a carpenter.$2#$e#Well, at least is good for the farm.",
        "Rainy_Day_1": "I checked the buildings just in case. Doesn't seem to be any leaks.",
        "Rainy_Day_2": "Good morning @! I woke up early from the sound of the rain and made you some breakfast. [194 195 210 211 216]  #$e#Stay warm and don't work too hard. I want you to stay healthy.",
        "Rainy_Day_3": "I hope the road to my old house doesn't get too muddy.$2",
		"Rainy_Day_4": "Any dinner requests for tonight?",
		"Rainy_Night_0": "The rain makes it feel like we're all alone.$6#$e#I'm cold... Aren't you ready to tuck into bed?$6",
        "Rainy_Night_1": "Make sure you change into something warm. I don't want you to get sick.#$e#Can you hear the rain pattering on the roof, @?",
        "Rainy_Night_2": "Ah...The soothing sound of rain overhead... I'm going to sleep well tonight.",
        "Rainy_Night_3": "Working with wood can be so relaxing.$u#$e#I should try teaching you some time, maybe you'll like it.",
        "Rainy_Night_4": "Hey @, glad you're home... I missed you.$7#$b#.",
		"Indoor_Day_0": "Good morning @#$e#Ready for a hard day's work? I am.",
		"Indoor_Day_1": "Make sure to eat plenty, you'll need energy for the day. I know how tiring manual work can be.",
		"Indoor_Day_2": "Did you sleep well honey?.#$b#Me? Of course.",
		"Indoor_Day_3": "Hey, someone must've gotten a good night of sleep... No wonder after yesterday's night.$7",
		"Indoor_Day_4": "Good morning, honey. Another day of farm chores, huh?",
		"Indoor_Night_0": "*Yawn* I'm so tired.$5",
		"Indoor_Night_1": "Wow, you look tired today honey.#$b#I hope you still have some energy for later.$7",
		"Indoor_Night_2": "You look like you've been working hard @. Let me help you de-stress.$7",
		"Indoor_Night_3": "Are you done with your work for the day? I'm ready to have some fun.$7",
		"Indoor_Night_4": "*phew*! I just finished my work for today. Now we can spend some time together.#$e#So, tell me about your day.",
		"Introduction": "Have you met everyone in town yet? That sounds exhausting.",
        "Resort": "Wow, look at these structures!$h#$b#I can tell they were made by a master builder. I'm really impressed!",
        "Resort_Leaving": "That was fun!$h",
        "Resort_Shore": "Hey, look! I can see another island from here.",
        "Resort_Chair": "Hey @. You know, I was just thinking about how far the town has come since you first moved here.#$b#As you wife, I must say that I'm proud of you.",
        "Resort_Bar": "This is so relaxing...",
        "reject_865": "Veggie salt? Sounds good, but I don't need it.",
        "reject_866": "Hmm... when I think of flowers, I think of Evelyn. Maybe show this to her?",
        "pamHouseUpgrade": "Our little plan worked out well, don't you think? Pam and Penny seem really happy.",
        "pamHouseUpgradeAnonymous": "Our little plan worked out well, don't you think? Pam and Penny seem really happy.",
        "MovieInvitation": "Ooh... Two tickets for tonight's show, huh? Sounds good! I'll meet you there.$h",
        "cc_Bridge": "Hey! I heard some weird noises last night, and woke up this morning to find the quarry bridge completely repaired!#$b#It's a miracle of woodworking!",
        "cc_Complete": "I knew it from the moment you stepped off that bus, @... you were destined to be a town hero!$h",
        "cc_Begin": "Hey! I heard that Lewis showed you around the Community Center... It'd be great if you could fix that place up. It used to be a really nice building!",
        "Mon": "Have I told you that I built my old house from the ground up?#$e#It's definitely been the highlight of my career so far.",
        "Tue": "I wonder what I should do with the laboratory at my house. Maybe I can renovate it.",
        "Wed": "Hey there, @.#$e#I was just daydreaming about some new carpentry projects.",
        "Thu": "It can get pretty lonely up here in the mountains. Visit me as much as you want honey.",
        "Fri": "You've met my son Sebastian, right? He lives downstairs.#$e#He's a little shy, but I'm sure he'll warm up to you if you're nice to him.",
        "Fri_inlaw_Sebastian": "I miss my Sebby... he was always a little misunderstood, but I believed in him.",
        "Fri4": "#$1 RobinSeb#I found an ashtray in Sebastian's room, and it smelled really weird. Should I be worried about this?#$e#Sometimes I worry about Sebastian... he doesn't have many friends and doesn't really seem to care about his future very much...#$e#I would talk to him about it but he never opens up to me.",
        "Fri4_inlaw_Sebastian": "Sebastian told me he's trying to quit smoking! I'm really proud of him.",
        "Sat": "Both our houses are in beautiful areas, we're so lucky.",
        "Sun": "I'm not even sure what Maru's working on. I think it has something to do with black holes.",
        "Sun2": "Hi honey! It's good to see you.",
        "Sun6": "Hi honey! It's good to see you.",
        "event_wood1": "Great, then this blueprint should be a piece of cake for you!$h",
        "event_wood2": "Well, then I have the perfect blueprint to get you started!",
        "summer_Mon": "Wood is a wonderful substance... it's versatile, cheap, strong, and each piece has it's own unique character!",
        "summer_Tue": "If you need any buildings on your farm upgraded, just ask me!#$e#You'll need to provide enough lumber and stone for the project. And it costs money, too.#$e#Yeah, I now you're my husband, but you're my best client too. I don't want to lose my income.$1",
        "summer_Fri": "We're pretty insulated from the rest of the world here in Stardew Valley.#$e#It has its pros and cons.",
        "fall_Mon": "#$1 RobinMaru#Maru likes gems. She uses them in her inventions.#$e#So how are you and Maru getting along?",
        "fall_Thu": "It can get pretty lonely up here in the mountains. Visit me as much as you want honey.",
        "fall_Fri": "Have you met the wild man that lives behind my house?$s#$e#I guess I don't really mind, as long as he doesn't bother us.",
        "winter_Mon": "Hey, it's a perfect time of year to gather wood. Tell me if you need help.",
        "winter_Fri": "My parents were bewildered when I told them I wanted to be a carpenter.#$e#They were pretty old-fashioned.",
        "winter_Fri_inlaw_Sebastian": "I think the farm life is really healthy for Sebby.",
        "winter_Sat": "Everything looks still after a fresh snow. It's so beautiful"
}