{
"Format": "1.0.0",
"Changes": [
{
"Action": "EditData",
"Target": "Characters/Dialogue/MarriageDialoguePenny",
"entries": {
    "Rainy_Day_0": "On rainy days my thoughts always drift toward cinnamon and cookies.#$e#Why don't we bake some cookies together?$h",
    "Rainy_Day_1": "Good morning, honey. I got up early and brewed us some coffee. [395] #$e#It's nice to drink something warm on days like this.$h",
    "Rainy_Day_2": "It's raining outside. Make sure you don't catch a cold, honey.$3#$e#Stay indoors as much as possible. I really worry about you!$3",
    "Rainy_Day_3": "Good morning! I woke up early from the sound of the rain and made you some breakfast. [194 195 210 211 216]  #$e#Stay warm and don't work too hard. I want you to stay healthy.$h",
    "Rainy_Day_4": "On days like this, I love to curl up with a good book.#$e#If you'd like to, we could also snuggle up in a blanket together.$l",
    "patio_Penny": "#$c .5#Ah! I was so engrossed in my book that I didn't even hear you coming.$h#$e#This place is always so peaceful. I'm very happy here.#$e#Thank you for everything, @. I love you.$l",
    "Rainy_Night_0": "How was your day, honey? I spent my afternoon reading a novel.#$e#Let's head to bed early tonight, okay?#$b#You look cold, so I'll help warm you up.$l",
    "Rainy_Night_1": "I'm sure Mom's at the saloon about now... But I don't feel so bad about it anymore. It's out of my hands.#$e#Here and now, you're my top priority. Let's go to bed soon, honey.$l",
    "Rainy_Night_2": "I made soup for dinner tonight. Here, have some. [199 218 219 727 730] $h#$e#You need something hot on a day like this.#$b#... Even though you are plenty hot already.$l#$e#I don't know why I just said that. I'm so embarrassed right now!$h",
    "Rainy_Night_3": "The sound of rain used to bother me, when I lived in that old metal trailer. But it's quite soothing here.#$e#So many things have changed because of you. I just feel so happy.$h",
    "Rainy_Night_4": "Good evening, honey. I felt like making a nice dinner. I hope you like it. [212 214 225 209 200] $h",
    "Indoor_Day_0": "It's so peaceful here. I used to have the most horrific nightmares, but now I sleep like a baby.#$e#It's all thanks to you being by my side. I love you, @.$l",
    "Indoor_Day_1": "Good morning, @! I made you a hot breakfast. [195 210 211] #$e#It's important to me that you leave here with a full belly.$h",
    "Indoor_Day_2": "Sometimes I wish we both had more days off and could just stay in together all day.#$e#What would we do? I can think of a few things.$l",
    "Indoor_Day_3": "Good morning, honey. You look as beautiful as always today.$h#$e#Just so you know, I'm never going to let go of you.$l",
    "Indoor_Day_4": "Ah... You're so pretty I forgot what I was going to say...$l#$e#Sometimes I feel like my heart will burst with all the longing and excitement I feel when I think of you.$l",
    "Indoor_Night_0": "Good evening, honey. Did you accomplish everything you wanted to today?#$e#If not, that's okay. We've got all the time in the world!$h",
    "Indoor_Night_1": "Hmm... skirt or pants tomorrow? Oh, who am I kidding... I always go with the skirt.#$e#Anyway, it's bedtime, honey. I can't wait to snuggle up under the covers.$h",
    "Indoor_Night_2": "Oh, you're home! How was your day, honey?$h#$e#Mine was good, but a little lonely. I'm glad you're back.#$e#I think it's official. I can't live my life without you anymore!$h",
    "Indoor_Night_3": "Mom's probably pretty lonely now that I'm gone. I just hope she doesn't visit the saloon more to make up for it.#$e#You shouldn't feel bad! Mom has to solve her own problems.",
    "Indoor_Night_4": "Ready to tuck in? I made the bed and everything...#$e#Also, um... how about letting me massage your back today? I bought some oils...$l",
    "Outdoor_0": "I only ever dreamed of living in such a beautiful place, and now it's come true.#$e#I can't express into words how much you mean to me.$l",
    "Outdoor_1": "Isn't this a perfect place to raise children?#$e#I would've been so happy growing up on a farm.",
    "Outdoor_2": "Hi, honey! How about a healthy snack to stay energized? [613 398 634] $h#$e#If I knew more about farm work I'd help you out more. Sorry!",
    "Outdoor_3": "I just saw a songbird flying due west. In Stardew Valley that's a very good omen.$h",
    "Outdoor_4": "Ahh... It feels great to be outside. I could spend all day right here, observing every little thing.#$e#Just look at %pet strolling around the farm. Isn't this pure bliss?$h",
    "OneKid_0": "Have you had any time to play with %kid1 today? Maybe a second child will make things better.",
    "OneKid_1": "Little %kid1 is going to have such a great childhood here.",
    "OneKid_3": "I feel a lot older now that we have a child. Maybe it's just this new responsibility weighing on me.#$e#It's not bad! I've wanted this for a long time.",
    "OneKid_4": "I wanted a child for a very long time. %kid1 is like a blessing to me.#$e#You are too, honey.$h",
    "TwoKids_0": "I already gave %kid1 and %kid2 their food. They're such hungry children!",
    "TwoKids_1": "We have to make sure and give %kid1 a lot of attention now that we have %kid2. We don't want any jealousy between them.",
    "TwoKids_2": "I've had this dream that %kid2 grew wings and flew into the night sky. What does it mean?",
    "TwoKids_3": "A nice house, two wonderful kids, and a beautiful plot of land. We're so very fortunate.",
    "Good_0": "I love you so much, @.$l#$b#Thank you for being with me.$h",
    "Good_1": "I had dreams of marrying you for such a long time.$l#$b#I still can't believe they all came true.$h",
    "Good_2": "I knew you were the one from the moment you moved here...$l",
    "Good_3": "Wow, you look incredibly beautiful today!$l#$e#I am so blessed to have you, @.$l",
    "Good_4": "I just wanted to say thank you for being you.#$e#You bring a smile to my face every day.$h",
    "Good_5": "Wow, you smell so good today, honey.$l#$e#So natural and captivating...$l",
    "Good_6": "You are the best thing that ever happened to me, @.#$e#I promise I'll love you till the end of time.$l",
    "Good_7": "I was just admiring the mermaid's pendant you gave me... I'll proudly wear this to my grave.",
    "Good_8": "I love being around you, @. You bring out the best in me.$h#$e#I'm never going to leave your side.$l",
    "Good_9": "@, you mean so much to me. I love you from the bottom of my heart.$l#$e#You're my everything, and I'm yours forever.$l",
    "funLeave_Penny": "#$c .5#Rise and shine! You look lovely today.$h#$e#I'm going to head into town today, just for fun. I'll be back in a while!#$e#See you later, honey. I love you.$l",
    "funReturn_Penny": "I had a nice time... It's good to stay in contact with everyone. Tell me about your day.",
    "jobLeave_Penny": "#$c .5#Good morning! Did you sleep well?$h#$b#I have to go into town today. Don't work too hard, and eat something good for lunch!#$e#See you tonight, honey. I'll be thinking of you.$l",
    "jobReturn_Penny": "#$c .5#Good evening, honey. How was your day?.#$e#Jas and Vincent weren't behaving very well today. I'm still all wound up...$3#$e#Well, it's time to unwind and relax now.$h#$b#I'm just looking forward to bedtime with you.$l",
    "spring_1": "We've got a long, warm year to look forward to. Let's make it a productive one.",
    "spring_8": "Spring is probably my favorite season. There's a certain freshness in the air that fills me with hope.",
    "spring_12": "Oh, it's a festival tomorrow, isn't it? Large crowds, activities... *gulp*$s#$e#I'm so glad I'm going to have you by my side, honey.$h",
    "spring_15": "Ah, the 'spring cleaning'... I'm actually going to enjoy this.",
    "spring_23": "W...Will you dance with me at the festival tomorrow, honey?$3#$e#It's always a little embarrassing, so I'm really glad you are with me.$h",
    "summer_1": "Summer may be searing hot, but the humidity feels great on the skin.",
    "summer_2": "In summer, the ants become very active. I could watch them for hours... they have a pretty complex civilization from the looks of it!",
    "summer_5": "Make sure you don't get a heat stroke, honey.$3#$e#Drink plenty of water and don't overwork yourself.",
    "summer_8": "Sorry if I smell... I was sweating all night in the heat.$3#$e#On the contrary, you smell as alluring as ever.$l",
    "summer_10": "Have you thought about what you're going to put in the luau soup?#$e#I'm fully confident that you'll choose something great.$h",
    "summer_15": "It's midsummer... the mosquitoes are getting worse lately.#$e#Don't worry, I'll take care of them.",
    "summer_17": "*phew*... I need to eat more melon to combat this heat!#$e#Or perhaps you'd like to rub my body with some ice cubes to cool it down?$l#$e#Why did I say this? Now I feel even hotter than before!$h",
    "fall_1": "Fall... It makes me think of colored paper and glue. Maybe I'm spending too much time with the children.$h",
    "fall_2": "It's my birthday today, but we don't have to do anything special.#$b#Every day I spend with you is already like a gift to me.$h",
    "fall_5": "The smell of fall reminds me of the smell of books... weird, isn't it?",
    "fall_8": "Winter's just around the corner. We need to double check the heating system, turn off the valves, and check all the insulation in the house.#$e#Don't worry about a thing, I'll take care of it all!$h",
    "fall_15": "Have you figured out what you're going to use for our grange display tomorrow?#$e#I know you'll make the right choice, because you always do.$h#$b#I love you, @.$l",
    "fall_26": "I'm not sure if I'm brave enough to enter the maze at the Spirit's Eve festival tomorrow night...$3#$e#Maybe if you hold my hand, @. I always feel more courageous when I'm with you.$h",
    "winter_1": "Winter's a good time to unwind a bit. You deserve it after the long year!",
    "winter_3": "How will we stay afloat this winter?$3#$b#Oh, you don't have to tell me. I trust you to make the right decisions.$h#$e#Maybe I'll just be happy to get more of you to myself for a while.$l",
    "winter_5": "The falling snow reminds me of grandma, rocking by the fire.#$b#I mostly remember her shadow flickering against the orange wood. That was long ago.",
    "winter_7": "The Festival of Ice is tomorrow. I'll cheer for you as loud as I can at the fishing contest!$h",
    "winter_12": "Winter has a quiet and romantic feel to it, doesn't it? The snow is beautiful...#$b#Although not as beautiful as you are, honey.$l",
    "winter_24": "Are you excited about the gift exchange tomorrow?#$e#I'll be crossing my fingers you'll get something nice.$h",
    "winter_28": "The year is almost over...$3#$e#Time really flies when you spend it with the one you love.$h",
	}
}
]
}